// --створити масив з:
//     - з 5 числових значень
// - з 5 стічкових значень
// - з 5 значень стрічкового, числового та булевого типу
// - та вивести його в консоль

let arr1 = [1, 2, 3, 4, 5];
let arr2 = ['aa', 'bb', 'cc', 'dd', 'ee'];
let arr3 = [1, 'aa', true, false, 234];

console.log(arr1);
console.log(arr2);
console.log(arr3);


// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль

let arrEmpty = [];
arrEmpty[0] = 'first';
arrEmpty[1] = 2989;
arrEmpty[2] = 'first';
arrEmpty[3] = true;
console.log(arrEmpty);


// - є масив [2,17,13,6,22,31,45,66,100,-18] :

let array = [2,17,13,6,22,31,45,66,100,-18];
// 1. перебрати його циклом while
let i = 0;
while (i < array.length){
    const arrVal = array[i];
    console.log(arrVal);
    i++
}
//     2. перебрати його циклом for
for (let j = 0; j < array.length; j++) {
    const arrayElement = array[j];
    console.log(arrayElement);

}

console.log('-------------------');
//     3. перебрати циклом while та вивести  числа тільки з непарним індексом
let x = 0;
while (x < array.length){
    if (x % 2 !== 0){
    console.log(array[x]);
}
    x++;
}
console.log('-------------------');



// 4. перебрати циклом for та вивести  числа тільки з непарним індексом

for (let j = 0; j < array.length; j++) {
    const arrayElement = array[j];
    if (j % 2 !== 0) {
        console.log(arrayElement);
    }
}
// 5. перебрати циклом while та вивести  числа тільки парні  значення
console.log('-------------------');
let z = 0;
while (z < array.length){
    if (z % 2 == 0){
        console.log(array[z]);
    }
    z++;
}
// 6. перебрати циклом for та вивести  числа тільки парні  значення

console.log('-------------------');
for (let j = 0; j < array.length; j++) {
    const arrayElement = array[j];
    if (j % 2 == 0) {
        console.log(arrayElement);
    }
}

console.log('-------------------');
// 7. замінити кожне число кратне 3 на слово "okten"
for (let j = 0; j < array.length; j++) {
    const arrayElement = array[j];
    if (j % 2 == 0) {
        console.log(arrayElement);
    }
}
// 8. вивести масив в зворотньому порядку.
// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
//
// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи
//
// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.
// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write
//
//
//
// стоврити масив книжок (назва, кількість сторінок, автори , жанри).
// -знайти наібльшу книжку.
// - знайти книжку/ки з найбільшою кількістю жанрів
// - знайти книжку/ки з найдовшою назвою
// - знайти книжку/ки які писали 2 автори
// - знайти книжку/ки які писав 1 автор